pmo-dataset/graphviz/48.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "select a starting\nblock";
  "ParallelGateway_1" -> "run for 5km";
  "ParallelGateway_1" -> "measure the time_1";
  "run for 5km" -> "ParallelGateway_2";
  "measure the time_1" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "time less than 25\nminutes?";
  "train" -> "ExclusiveGateway_1";
  "time less than 25\nminutes?" -> "train" [label="No"];
  "get your starting\nnumber" -> "calculate time\nbetween starting\ntime and the end of\nworkday";
  "ExclusiveGateway_2" -> "ParallelGateway_3";
  "ParallelGateway_3" -> "run";
  "ParallelGateway_4" -> "receive your final\nrunning time";
  "receive your final\nrunning time" -> "EndNoneEvent";
  "time more than 1\nhour?" -> "ExclusiveGateway_2" [label="No"];
  "calculate time\nbetween starting\ntime and the end of\nworkday" -> "time more than 1\nhour?";
  "run" -> "ParallelGateway_4";
  "drink" -> "ParallelGateway_4";
  "time less than 25\nminutes?" -> "get your starting\nnumber" [label="Yes"];
  "select a starting\nblock" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "ParallelGateway_1";
  "ParallelGateway_3" -> "drink";
  "ParallelGateway_3" -> "measure the time_2";
  "measure the time_2" -> "ParallelGateway_4";
  "go to home" -> "ExclusiveGateway_2";
  "time more than 1\nhour?" -> "go to home" [label="Yes"];

  "measure the time_1" [label="measure the time"];
  "measure the time_2" [label="measure the time"];
  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "time less than 25\nminutes?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "time more than 1\nhour?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
