pmo-dataset/variations/mermaid_basic/48.mmd
graph LR
	StartEvent_1((" ")) --> Task_1["select a starting block"]
	ParallelGateway_1{"+"} --> Task_7["run for 5km"]
	ParallelGateway_1 --> Task_3["measure the time"]
	Task_7 --> ParallelGateway_2{"+"}
	Task_3 --> ParallelGateway_2
	ParallelGateway_2 --> ExclusiveGateway_1{"time less than 25 minutes?"}
	Task_8["train"] --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_1 -->|"No"| Task_8
	Task_2["get your starting number"] --> Task_5["calculate time between starting time and the end of workday"]
	ExclusiveGateway_4{"X"} --> ParallelGateway_3{"+"}
	ParallelGateway_3 --> Task_10["run"]
	ParallelGateway_4{"+"} --> Task_4["receive your final running time"]
	Task_4 --> EndEvent_1((" "))
	ExclusiveGateway_3{"time more than 1 hour?"} -->|"No"| ExclusiveGateway_4
	Task_5 --> ExclusiveGateway_3
	Task_10 --> ParallelGateway_4
	Task_11["drink"] --> ParallelGateway_4
	ExclusiveGateway_1 -->|"Yes"| Task_2
	Task_1 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> ParallelGateway_1
	ParallelGateway_3 --> Task_11
	ParallelGateway_3 --> Task_6["measure the time"]
	Task_6 --> ParallelGateway_4
	Task_9["go to home"] --> ExclusiveGateway_4
	ExclusiveGateway_3 -->|"Yes"| Task_9
